{
  "results":[
  {
    "video_link": "https://youtu.be/ov8LEOMHOgk",
    "video_thumbnail_link":"https://hritikraheja1.github.io/images/animal_thumbnail.PNG",
    "icon_link":"https://hritikraheja1.github.io/images/animal_aid_unlimited.png",
    "title":"Puppy's paw was crushed and degloved, but when he healed, he sang!",
    "organization_name":"Animal Aid Unlimited, India";
    "description":"\nYou can put a song in someone's heart. Please donate: \n\nPlease donate: https://www.animalaidunlimited.org/donations/monthly-donation/. \n\nThis precious teenaged puppy screamed in pain when his rescuers tried to lift him. His feet had been run over by a vehicle, and one paw was crushed and degloved. His toes were splayed and swollen to twice their normal size. Standing was too excruciating to bear. Had he been an older dog with more brittle bones, he might have been facing an amputation, but this young boy still had soft bones. \n\n\nWe treated his wound and wrapped his intensely painful feet in thick bandages which we changed every day. The little guy was one of the most careful young patients we've ever had. He seemed determined to cause no fuss. But he was so inward we wondered if he was depressed. Then, when he'd progressed a bit on his healing journey, well, this boy burst out in song. Meet Elvis now!"
  },
  {
    "video_link": "https://youtu.be/AsbG2qyNnxs",
    "video_thumbnail_link":"https://hritikraheja1.github.io/images/animal_thumbnail_1.PNG",
    "icon_link":"https://hritikraheja1.github.io/images/animal_aid_unlimited.png",
    "title":"Bull grew but the rope did not, healing an excruciating wound",
    "organization_name":"Animal Aid Unlimited, India";
    "description":"Please make a donation to help rescue street animals: https://www.animalaidunlimited.org/donations/monthly-donation/ \n\nThe blood gradually began to ooze from the deep huge forehead wound caused by a rope squeezing tighter and tighter over months. Ownerless, we cannot fathom what moved someone to bind this poor gentle boy in the first place, only to then turn him loose to find his food on roadside plants and grasses. He grew, but the rope, of course, did not. When we found him, he was starting to fade away. Pain had dulled his appetite and he'd grown weary of fighting it. But within hours we had the maggots out of the wound, flushed away all the dirt and blood, and soothed him with a snug bandage that we would change daily for 7 weeks. We're so eager for you to meet Socrates here. The best remedy for human mistreatment of animals is extra kindness. \n\nRescue date : 16 January 2020"
  },
  {
    "video_link": "https://youtu.be/dSPgJz0Yrk0",
    "video_thumbnail_link":"https://hritikraheja1.github.io/images/animal_thumbnail_2.PNG",
    "icon_link":"https://hritikraheja1.github.io/images/vspca.png",
    "title":"Remarkable Recovery of Rani the survivor...!",
    "organization_name":"VSPCA, India";
    "description":"Rani an Indian Community dog has survived from a horrifying casualty and trauma now leading a happy life in VSPCA\n\nsupport VSPCA:\n\nvisit: www.vspca.org\n\nfollow: facebook/vspca\n\nsubscribe: vspca_vizag"
  },
  {
    "video_link": "https://youtu.be/B-caXBT4Q6w",
    "video_thumbnail_link":"https://hritikraheja1.github.io/images/animal_thumbnail_3.PNG",
    "icon_link":"https://hritikraheja1.github.io/images/animal_aid_unlimited.png",
    "title":"Sweetest bull horrifically wounded by car, rescued.",
    "organization_name":"Animal Aid Unlimited, India";
    "description":"The vehicle must have slammed into this beautiful bull at high speed. \n\n A huge chunk of flesh was simply missing as blood and gnarled tissue slipped along his ribs. Several passing motorists called us immediately after it happened, and we rushed to the site to find one of the most gentle beings we have ever met. \n\nFrom his first painful wound dressing until now, fully healed, Rollie did everything he could to make his difficult medical treatments as easy as possible. And when he healed, he set about nurturing the babies. \n\nMeet this giant love--Rollie--today."
  },
  {
    "video_link": "https://youtu.be/Kv9LHPYhyMw",
    "video_thumbnail_link":"https://hritikraheja1.github.io/images/animal_thumbnail_4.PNG",
    "icon_link":"https://hritikraheja1.github.io/images/animal_aid_unlimited.png",
    "title":"Legs tied together and left to die, donkey recovers from unimaginable cruelty.",
    "organization_name":"Animal Aid Unlimited, India";
    "description":"This is Bansi and we must tell you from the beginning--he was rescued, completely healed and he has flourished. The beginning of the video is particularly heart-breaking, and the question that will probably fill your heart and mind as you watch it is simply Why? Why would the owners tie this donkey so cruelly? What deranged mind is behind this? To what purpose? Sometimes the answer Ignorance is not sufficient. We immediately began the 2 month treatment process for Bansi and he healed beautifully. He also happens to be adorable, innocent, agreeable, quiet. He's happy now and police arrested and jailed his cruel owner. \n\nThere are about 600 working donkeys in Udaipur. \n\nWe are working to save as many as we can, with medical treatment, police and legal aid, and donkey education. Please donate: \n\nhttps://www.animalaidunlimited.org/donations/monthly-donation/"
  },
  {
    "video_link": "https://youtu.be/6hEOzJDt8Do",
    "video_thumbnail_link":"https://hritikraheja1.github.io/images/animal_thumbnail5.PNG",
    "icon_link":"https://hritikraheja1.github.io/images/animal_aid_unlimited.png",
    "title":"Dog paralysed from car accident walks again.",
    "organization_name":"Animal Aid Unlimited, India";
    "description":"We got a call on our rescue helpline to help a street dog in Udaipur, India, who had been hit by a car. When our rescuers arrived, we found him in the middle of an inner-city road with his back legs strangely stretched out in front of him, unable to stand or even move without great pain and difficulty.\n\n Nerve damage like he had suffered often does not recover, but we saw hope and we had to try. \n\n Please donate to save the injured street animals in India: \n https://www.animalaidunlimited.org/donations/monthly-donation/"
  },
  {
    "video_link": "https://youtu.be/sVQg0-3WSc4",
    "video_thumbnail_link":"https://hritikraheja1.github.io/images/animal_thumbnail_6.PNG",
    "icon_link":"https://hritikraheja1.github.io/images/animal_aid_unlimited.png",
    "title":"Dramatic rescue of injured calf from garbage dump in India.",
    "organization_name":"Animal Aid Unlimited, India";
    "description":"A baby calf was found terribly injured at a garbage dump in India.  A piece of plastic packing material had been tied around her neck when she was much younger, and as she had grown, it began cutting into the skin around her neck. When we found her it had cut several inches into her neck and was infested with maggots. \n\n Support our life-saving street animal rescue by donating today: \n https://www.animalaidunlimited.org/donations/monthly-donation/"
  },
  {
    "video_link": "https://youtu.be/lcfUdNfb808",
    "video_thumbnail_link":"https://hritikraheja1.github.io/images/animal_thumbnail_7.PNG",
    "icon_link":"https://hritikraheja1.github.io/images/animal_aid_unlimited.png",
    "title":"The dog who grew a new face – Kalu’s astounding recovery (graphic).",
    "organization_name":"Animal Aid Unlimited, India";
    "description":"Caution: This video contains graphic images of a severely wounded dog and his amazing recovery. \n\n We found Kalu inside of a hole at a construction site where he had gone to die. His face was severely wounded and infested with maggots. His recovery is truly one of the most awe-inspiring and miraculous recoveries we have ever seen. \n\n Please donate to give a second chance to street animals in India : \n https://www.animalaidunlimited.org/donations/monthly-donation/"
  },
  {
    "video_link": "https://youtu.be/DKpuplmxBM0",
    "video_thumbnail_link":"https://hritikraheja1.github.io/images/animal_thumbnail_8.PNG",
    "icon_link":"https://hritikraheja1.github.io/images/animal_aid_unlimited.png",
    "title":"Precious baby donkey's pain made him terrified, but when he healed, he loved!",
    "organization_name":"Animal Aid Unlimited, India";
    "description":"Helping someone who is hurting feels so good. Please donate: \n https://www.animalaidunlimited.org/donations/monthly-donation/ \n\n This little donkey's wound on his backside must have multiplied in size and depth once maggots began destroying the live tissue. Still energetic and optimistic, this precious boy, who we called Micky, seemed to have no idea that he was in grave danger and would have died without urgent rescue. \n\n\nHis mother's love would be a vital comfort to him, so of course we brought them together, and Mom's face, within moments, seemed to express relief that they were now in safe, healing hands. \n Watch now, as Micky's fear, during the days to come, turned into love."
  },
  {
    "video_link": "https://youtu.be/43QuVrRcaEE",
    "video_thumbnail_link":"https://hritikraheja1.github.io/images/animal_thumbnail_9.PNG",
    "icon_link":"https://hritikraheja1.github.io/images/animal_aid_unlimited.png",
    "title":"Impaled by a rod, dog in agony before rescue--beautiful recovery.",
    "organization_name":"Animal Aid Unlimited, India";
    "description":"Extra love helps those who need extra courage. Please donate: https://www.animalaidunlimited.org/donations/monthly-donation/ \n\n Neighbors spotted a beautiful dog laying by a rod in a construction site. When they came closer they saw to their horror that the rod had pierced through her thigh and she had impaled her. She couldn't get free no matter how she struggled. They called Animal Aid to the rescue, and we quickly arranged for workers to come with an electric metal saw. \n\nThe terrified dog had to endure terrifying sounds of the saw against the metal, but we covered comforted her while the rod was cut and we were able to free her. \n\nHer wound was serious but because no bones had broken, we were able to clean, bandage and protect her with antibiotics. After her ordeal, she needed extra love to find the courage she would need to heal. \n\n And after a month of daily wound dressings and many cuddles, meet Shylee now!"
  }
]
}
